7767517
76 88
Input                    data                     0 1 data
Convolution              mobileclip0_feature_conv0_fwd 1 1 data mobileclip0_feature_relu0_fwd 0=64 1=3 3=2 4=1 5=1 6=1728 9=1
ConvolutionDepthWise     mobileclip0_feature_conv1_fwd 1 1 mobileclip0_feature_relu0_fwd mobileclip0_feature_relu1_fwd 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              mobileclip0_feature_stage1_bottleneck0_conv0_fwd 1 1 mobileclip0_feature_relu1_fwd mobileclip0_feature_stage1_bottleneck0_relu0_fwd 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     mobileclip0_feature_stage1_bottleneck0_conv1_fwd 1 1 mobileclip0_feature_stage1_bottleneck0_relu0_fwd mobileclip0_feature_stage1_bottleneck0_relu1_fwd 0=128 1=3 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              mobileclip0_feature_stage1_bottleneck0_conv2_fwd 1 1 mobileclip0_feature_stage1_bottleneck0_relu1_fwd mobileclip0_feature_stage1_bottleneck0_batchnorm2_fwd 0=64 1=1 5=1 6=8192
Split                    splitncnn_0              1 2 mobileclip0_feature_stage1_bottleneck0_batchnorm2_fwd mobileclip0_feature_stage1_bottleneck0_batchnorm2_fwd_splitncnn_0 mobileclip0_feature_stage1_bottleneck0_batchnorm2_fwd_splitncnn_1
Convolution              mobileclip0_feature_stage1_bottleneck1_conv0_fwd 1 1 mobileclip0_feature_stage1_bottleneck0_batchnorm2_fwd_splitncnn_1 mobileclip0_feature_stage1_bottleneck1_relu0_fwd 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     mobileclip0_feature_stage1_bottleneck1_conv1_fwd 1 1 mobileclip0_feature_stage1_bottleneck1_relu0_fwd mobileclip0_feature_stage1_bottleneck1_relu1_fwd 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              mobileclip0_feature_stage1_bottleneck1_conv2_fwd 1 1 mobileclip0_feature_stage1_bottleneck1_relu1_fwd mobileclip0_feature_stage1_bottleneck1_batchnorm2_fwd 0=64 1=1 5=1 6=8192
BinaryOp                 mobileclip0_feature_stage1_bottleneck1_elemwise_add0 2 1 mobileclip0_feature_stage1_bottleneck1_batchnorm2_fwd mobileclip0_feature_stage1_bottleneck0_batchnorm2_fwd_splitncnn_0 mobileclip0_feature_stage1_bottleneck1_elemwise_add0
Split                    splitncnn_1              1 2 mobileclip0_feature_stage1_bottleneck1_elemwise_add0 mobileclip0_feature_stage1_bottleneck1_elemwise_add0_splitncnn_0 mobileclip0_feature_stage1_bottleneck1_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage1_bottleneck2_conv0_fwd 1 1 mobileclip0_feature_stage1_bottleneck1_elemwise_add0_splitncnn_1 mobileclip0_feature_stage1_bottleneck2_relu0_fwd 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     mobileclip0_feature_stage1_bottleneck2_conv1_fwd 1 1 mobileclip0_feature_stage1_bottleneck2_relu0_fwd mobileclip0_feature_stage1_bottleneck2_relu1_fwd 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              mobileclip0_feature_stage1_bottleneck2_conv2_fwd 1 1 mobileclip0_feature_stage1_bottleneck2_relu1_fwd mobileclip0_feature_stage1_bottleneck2_batchnorm2_fwd 0=64 1=1 5=1 6=8192
BinaryOp                 mobileclip0_feature_stage1_bottleneck2_elemwise_add0 2 1 mobileclip0_feature_stage1_bottleneck2_batchnorm2_fwd mobileclip0_feature_stage1_bottleneck1_elemwise_add0_splitncnn_0 mobileclip0_feature_stage1_bottleneck2_elemwise_add0
Split                    splitncnn_2              1 2 mobileclip0_feature_stage1_bottleneck2_elemwise_add0 mobileclip0_feature_stage1_bottleneck2_elemwise_add0_splitncnn_0 mobileclip0_feature_stage1_bottleneck2_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage1_bottleneck3_conv0_fwd 1 1 mobileclip0_feature_stage1_bottleneck2_elemwise_add0_splitncnn_1 mobileclip0_feature_stage1_bottleneck3_relu0_fwd 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     mobileclip0_feature_stage1_bottleneck3_conv1_fwd 1 1 mobileclip0_feature_stage1_bottleneck3_relu0_fwd mobileclip0_feature_stage1_bottleneck3_relu1_fwd 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              mobileclip0_feature_stage1_bottleneck3_conv2_fwd 1 1 mobileclip0_feature_stage1_bottleneck3_relu1_fwd mobileclip0_feature_stage1_bottleneck3_batchnorm2_fwd 0=64 1=1 5=1 6=8192
BinaryOp                 mobileclip0_feature_stage1_bottleneck3_elemwise_add0 2 1 mobileclip0_feature_stage1_bottleneck3_batchnorm2_fwd mobileclip0_feature_stage1_bottleneck2_elemwise_add0_splitncnn_0 mobileclip0_feature_stage1_bottleneck3_elemwise_add0
Split                    splitncnn_3              1 2 mobileclip0_feature_stage1_bottleneck3_elemwise_add0 mobileclip0_feature_stage1_bottleneck3_elemwise_add0_splitncnn_0 mobileclip0_feature_stage1_bottleneck3_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage1_bottleneck4_conv0_fwd 1 1 mobileclip0_feature_stage1_bottleneck3_elemwise_add0_splitncnn_1 mobileclip0_feature_stage1_bottleneck4_relu0_fwd 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     mobileclip0_feature_stage1_bottleneck4_conv1_fwd 1 1 mobileclip0_feature_stage1_bottleneck4_relu0_fwd mobileclip0_feature_stage1_bottleneck4_relu1_fwd 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              mobileclip0_feature_stage1_bottleneck4_conv2_fwd 1 1 mobileclip0_feature_stage1_bottleneck4_relu1_fwd mobileclip0_feature_stage1_bottleneck4_batchnorm2_fwd 0=64 1=1 5=1 6=8192
BinaryOp                 mobileclip0_feature_stage1_bottleneck4_elemwise_add0 2 1 mobileclip0_feature_stage1_bottleneck4_batchnorm2_fwd mobileclip0_feature_stage1_bottleneck3_elemwise_add0_splitncnn_0 mobileclip0_feature_stage1_bottleneck4_elemwise_add0
Convolution              mobileclip0_feature_stage2_bottleneck0_conv0_fwd 1 1 mobileclip0_feature_stage1_bottleneck4_elemwise_add0 mobileclip0_feature_stage2_bottleneck0_relu0_fwd 0=256 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     mobileclip0_feature_stage2_bottleneck0_conv1_fwd 1 1 mobileclip0_feature_stage2_bottleneck0_relu0_fwd mobileclip0_feature_stage2_bottleneck0_relu1_fwd 0=256 1=3 3=2 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage2_bottleneck0_conv2_fwd 1 1 mobileclip0_feature_stage2_bottleneck0_relu1_fwd mobileclip0_feature_stage2_bottleneck0_batchnorm2_fwd 0=128 1=1 5=1 6=32768
Split                    splitncnn_4              1 2 mobileclip0_feature_stage2_bottleneck0_batchnorm2_fwd mobileclip0_feature_stage2_bottleneck0_batchnorm2_fwd_splitncnn_0 mobileclip0_feature_stage2_bottleneck0_batchnorm2_fwd_splitncnn_1
Convolution              mobileclip0_feature_stage3_bottleneck0_conv0_fwd 1 1 mobileclip0_feature_stage2_bottleneck0_batchnorm2_fwd_splitncnn_1 mobileclip0_feature_stage3_bottleneck0_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage3_bottleneck0_conv1_fwd 1 1 mobileclip0_feature_stage3_bottleneck0_relu0_fwd mobileclip0_feature_stage3_bottleneck0_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage3_bottleneck0_conv2_fwd 1 1 mobileclip0_feature_stage3_bottleneck0_relu1_fwd mobileclip0_feature_stage3_bottleneck0_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage3_bottleneck0_elemwise_add0 2 1 mobileclip0_feature_stage3_bottleneck0_batchnorm2_fwd mobileclip0_feature_stage2_bottleneck0_batchnorm2_fwd_splitncnn_0 mobileclip0_feature_stage3_bottleneck0_elemwise_add0
Split                    splitncnn_5              1 2 mobileclip0_feature_stage3_bottleneck0_elemwise_add0 mobileclip0_feature_stage3_bottleneck0_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck0_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage3_bottleneck1_conv0_fwd 1 1 mobileclip0_feature_stage3_bottleneck0_elemwise_add0_splitncnn_1 mobileclip0_feature_stage3_bottleneck1_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage3_bottleneck1_conv1_fwd 1 1 mobileclip0_feature_stage3_bottleneck1_relu0_fwd mobileclip0_feature_stage3_bottleneck1_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage3_bottleneck1_conv2_fwd 1 1 mobileclip0_feature_stage3_bottleneck1_relu1_fwd mobileclip0_feature_stage3_bottleneck1_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage3_bottleneck1_elemwise_add0 2 1 mobileclip0_feature_stage3_bottleneck1_batchnorm2_fwd mobileclip0_feature_stage3_bottleneck0_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck1_elemwise_add0
Split                    splitncnn_6              1 2 mobileclip0_feature_stage3_bottleneck1_elemwise_add0 mobileclip0_feature_stage3_bottleneck1_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck1_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage3_bottleneck2_conv0_fwd 1 1 mobileclip0_feature_stage3_bottleneck1_elemwise_add0_splitncnn_1 mobileclip0_feature_stage3_bottleneck2_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage3_bottleneck2_conv1_fwd 1 1 mobileclip0_feature_stage3_bottleneck2_relu0_fwd mobileclip0_feature_stage3_bottleneck2_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage3_bottleneck2_conv2_fwd 1 1 mobileclip0_feature_stage3_bottleneck2_relu1_fwd mobileclip0_feature_stage3_bottleneck2_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage3_bottleneck2_elemwise_add0 2 1 mobileclip0_feature_stage3_bottleneck2_batchnorm2_fwd mobileclip0_feature_stage3_bottleneck1_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck2_elemwise_add0
Split                    splitncnn_7              1 2 mobileclip0_feature_stage3_bottleneck2_elemwise_add0 mobileclip0_feature_stage3_bottleneck2_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck2_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage3_bottleneck3_conv0_fwd 1 1 mobileclip0_feature_stage3_bottleneck2_elemwise_add0_splitncnn_1 mobileclip0_feature_stage3_bottleneck3_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage3_bottleneck3_conv1_fwd 1 1 mobileclip0_feature_stage3_bottleneck3_relu0_fwd mobileclip0_feature_stage3_bottleneck3_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage3_bottleneck3_conv2_fwd 1 1 mobileclip0_feature_stage3_bottleneck3_relu1_fwd mobileclip0_feature_stage3_bottleneck3_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage3_bottleneck3_elemwise_add0 2 1 mobileclip0_feature_stage3_bottleneck3_batchnorm2_fwd mobileclip0_feature_stage3_bottleneck2_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck3_elemwise_add0
Split                    splitncnn_8              1 2 mobileclip0_feature_stage3_bottleneck3_elemwise_add0 mobileclip0_feature_stage3_bottleneck3_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck3_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage3_bottleneck4_conv0_fwd 1 1 mobileclip0_feature_stage3_bottleneck3_elemwise_add0_splitncnn_1 mobileclip0_feature_stage3_bottleneck4_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage3_bottleneck4_conv1_fwd 1 1 mobileclip0_feature_stage3_bottleneck4_relu0_fwd mobileclip0_feature_stage3_bottleneck4_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage3_bottleneck4_conv2_fwd 1 1 mobileclip0_feature_stage3_bottleneck4_relu1_fwd mobileclip0_feature_stage3_bottleneck4_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage3_bottleneck4_elemwise_add0 2 1 mobileclip0_feature_stage3_bottleneck4_batchnorm2_fwd mobileclip0_feature_stage3_bottleneck3_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck4_elemwise_add0
Split                    splitncnn_9              1 2 mobileclip0_feature_stage3_bottleneck4_elemwise_add0 mobileclip0_feature_stage3_bottleneck4_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck4_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage3_bottleneck5_conv0_fwd 1 1 mobileclip0_feature_stage3_bottleneck4_elemwise_add0_splitncnn_1 mobileclip0_feature_stage3_bottleneck5_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage3_bottleneck5_conv1_fwd 1 1 mobileclip0_feature_stage3_bottleneck5_relu0_fwd mobileclip0_feature_stage3_bottleneck5_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage3_bottleneck5_conv2_fwd 1 1 mobileclip0_feature_stage3_bottleneck5_relu1_fwd mobileclip0_feature_stage3_bottleneck5_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage3_bottleneck5_elemwise_add0 2 1 mobileclip0_feature_stage3_bottleneck5_batchnorm2_fwd mobileclip0_feature_stage3_bottleneck4_elemwise_add0_splitncnn_0 mobileclip0_feature_stage3_bottleneck5_elemwise_add0
Convolution              mobileclip0_feature_stage4_bottleneck0_conv0_fwd 1 1 mobileclip0_feature_stage3_bottleneck5_elemwise_add0 mobileclip0_feature_stage4_bottleneck0_relu0_fwd 0=512 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     mobileclip0_feature_stage4_bottleneck0_conv1_fwd 1 1 mobileclip0_feature_stage4_bottleneck0_relu0_fwd mobileclip0_feature_stage4_bottleneck0_relu1_fwd 0=512 1=3 3=2 4=1 5=1 6=4608 7=512 9=1
Convolution              mobileclip0_feature_stage4_bottleneck0_conv2_fwd 1 1 mobileclip0_feature_stage4_bottleneck0_relu1_fwd mobileclip0_feature_stage4_bottleneck0_batchnorm2_fwd 0=128 1=1 5=1 6=65536
Split                    splitncnn_10             1 2 mobileclip0_feature_stage4_bottleneck0_batchnorm2_fwd mobileclip0_feature_stage4_bottleneck0_batchnorm2_fwd_splitncnn_0 mobileclip0_feature_stage4_bottleneck0_batchnorm2_fwd_splitncnn_1
Convolution              mobileclip0_feature_stage5_bottleneck0_conv0_fwd 1 1 mobileclip0_feature_stage4_bottleneck0_batchnorm2_fwd_splitncnn_1 mobileclip0_feature_stage5_bottleneck0_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage5_bottleneck0_conv1_fwd 1 1 mobileclip0_feature_stage5_bottleneck0_relu0_fwd mobileclip0_feature_stage5_bottleneck0_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage5_bottleneck0_conv2_fwd 1 1 mobileclip0_feature_stage5_bottleneck0_relu1_fwd mobileclip0_feature_stage5_bottleneck0_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage5_bottleneck0_elemwise_add0 2 1 mobileclip0_feature_stage5_bottleneck0_batchnorm2_fwd mobileclip0_feature_stage4_bottleneck0_batchnorm2_fwd_splitncnn_0 mobileclip0_feature_stage5_bottleneck0_elemwise_add0
Split                    splitncnn_11             1 2 mobileclip0_feature_stage5_bottleneck0_elemwise_add0 mobileclip0_feature_stage5_bottleneck0_elemwise_add0_splitncnn_0 mobileclip0_feature_stage5_bottleneck0_elemwise_add0_splitncnn_1
Convolution              mobileclip0_feature_stage5_bottleneck1_conv0_fwd 1 1 mobileclip0_feature_stage5_bottleneck0_elemwise_add0_splitncnn_1 mobileclip0_feature_stage5_bottleneck1_relu0_fwd 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     mobileclip0_feature_stage5_bottleneck1_conv1_fwd 1 1 mobileclip0_feature_stage5_bottleneck1_relu0_fwd mobileclip0_feature_stage5_bottleneck1_relu1_fwd 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              mobileclip0_feature_stage5_bottleneck1_conv2_fwd 1 1 mobileclip0_feature_stage5_bottleneck1_relu1_fwd mobileclip0_feature_stage5_bottleneck1_batchnorm2_fwd 0=128 1=1 5=1 6=32768
BinaryOp                 mobileclip0_feature_stage5_bottleneck1_elemwise_add0 2 1 mobileclip0_feature_stage5_bottleneck1_batchnorm2_fwd mobileclip0_feature_stage5_bottleneck0_elemwise_add0_splitncnn_0 mobileclip0_feature_stage5_bottleneck1_elemwise_add0
Convolution              mobileclip0_feature_conv2_fwd 1 1 mobileclip0_feature_stage5_bottleneck1_elemwise_add0 mobileclip0_feature_relu2_fwd 0=512 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     mobileclip0_feature_conv3_fwd 1 1 mobileclip0_feature_relu2_fwd mobileclip0_feature_batchnorm3_fwd 0=512 1=7 5=1 6=25088 7=512
Convolution              mobileclip0_feature_conv4_fwd 1 1 mobileclip0_feature_batchnorm3_fwd mobileclip0_feature_batchnorm4_fwd 0=128 1=1 5=1 6=65536
Flatten                  mobileclip0_feature_flatten0_flatten0 1 1 mobileclip0_feature_batchnorm4_fwd mobileclip0_feature_flatten0_flatten0
