7767517
40 48
Input                    data                     0 1 data
BinaryOp                 attr__mulscalar0         1 1 data attr__mulscalar0 0=2 1=1 2=3.921000e-03
Convolution              attr_hybridsequential0_conv0_fwd 1 1 attr__mulscalar0 attr_hybridsequential0_relu0_fwd 0=16 1=5 3=2 4=2 5=1 6=1200 9=1
Convolution              attr_hybridsequential1_conv0_fwd 1 1 attr_hybridsequential0_relu0_fwd attr_hybridsequential1_relu0_fwd 0=32 1=3 4=1 5=1 6=4608 9=1
Convolution              attr_hybridsequential2_conv0_fwd 1 1 attr_hybridsequential1_relu0_fwd attr_hybridsequential2_relu0_fwd 0=32 1=3 3=2 4=1 5=1 6=9216 9=1
Split                    splitncnn_0              1 2 attr_hybridsequential2_relu0_fwd attr_hybridsequential2_relu0_fwd_splitncnn_0 attr_hybridsequential2_relu0_fwd_splitncnn_1
Convolution              attr_hybridsequential3_conv0_fwd 1 1 attr_hybridsequential2_relu0_fwd_splitncnn_1 attr_hybridsequential3_relu0_fwd 0=32 1=3 4=1 5=1 6=9216 9=1
Convolution              attr_hybridsequential4_conv0_fwd 1 1 attr_hybridsequential3_relu0_fwd attr_hybridsequential4_relu0_fwd 0=32 1=3 3=2 4=1 5=1 6=9216 9=1
Split                    splitncnn_1              1 2 attr_hybridsequential4_relu0_fwd attr_hybridsequential4_relu0_fwd_splitncnn_0 attr_hybridsequential4_relu0_fwd_splitncnn_1
Convolution              attr_hybridsequential5_conv0_fwd 1 1 attr_hybridsequential4_relu0_fwd_splitncnn_1 attr_hybridsequential5_relu0_fwd 0=32 1=3 4=1 5=1 6=9216 9=1
Convolution              attr_hybridsequential6_conv0_fwd 1 1 attr_hybridsequential5_relu0_fwd attr_hybridsequential6_relu0_fwd 0=32 1=3 3=2 5=1 6=9216 9=1
Split                    splitncnn_2              1 2 attr_hybridsequential6_relu0_fwd attr_hybridsequential6_relu0_fwd_splitncnn_0 attr_hybridsequential6_relu0_fwd_splitncnn_1
Convolution              attr_hybridsequential7_conv0_fwd 1 1 attr_hybridsequential6_relu0_fwd_splitncnn_1 attr_hybridsequential7_relu0_fwd 0=64 1=3 4=1 5=1 6=18432 9=1
Convolution              attr_hybridsequential8_conv0_fwd 1 1 attr_hybridsequential7_relu0_fwd attr_hybridsequential8_relu0_fwd 0=64 1=3 3=2 5=1 6=36864 9=1
InnerProduct             attr_dense0_fwd          1 1 attr_hybridsequential8_relu0_fwd attr_relu0_fwd 0=64 2=4096 9=1
Split                    splitncnn_3              1 3 attr_relu0_fwd attr_relu0_fwd_splitncnn_0 attr_relu0_fwd_splitncnn_1 attr_relu0_fwd_splitncnn_2
InnerProduct             attr_dense2_fwd          1 1 attr_relu0_fwd_splitncnn_2 attr_score_fwd 0=1 1=1 2=64 9=4
Pooling                  attr_pool0_fwd           1 1 attr_hybridsequential2_relu0_fwd_splitncnn_0 attr_pool0_fwd 1=2 2=2 5=1
BinaryOp                 attr_elemwise_add0       2 1 attr_hybridsequential4_relu0_fwd_splitncnn_0 attr_pool0_fwd attr_elemwise_add0
Convolution              attr_hybridsequential9_conv0_fwd 1 1 attr_elemwise_add0 attr_hybridsequential9_batchnorm0_fwd 0=32 1=3 5=1 6=9216
Deconvolution            attr_DecT0_fwd           1 1 attr_hybridsequential6_relu0_fwd_splitncnn_0 attr_DecB0_fwd 0=32 1=4 3=2 4=1 5=1 6=16384
BinaryOp                 attr_elemwise_add1       2 1 attr_hybridsequential9_batchnorm0_fwd attr_DecB0_fwd attr_elemwise_add1
ReLU                     attr_relu0               1 1 attr_elemwise_add1 attr_relu0
Convolution              attr_hybridsequential10_conv0_fwd 1 1 attr_relu0 attr_hybridsequential10_relu0_fwd 0=32 1=3 4=1 5=1 6=9216 9=1
Convolution              attr_hybridsequential11_conv0_fwd 1 1 attr_hybridsequential10_relu0_fwd attr_hybridsequential11_relu0_fwd 0=32 1=3 3=2 4=1 5=1 6=9216 9=1
Convolution              attr_hybridsequential12_conv0_fwd 1 1 attr_hybridsequential11_relu0_fwd attr_hybridsequential12_relu0_fwd 0=64 1=3 5=1 6=18432 9=1
InnerProduct             attr_dense1_fwd          1 1 attr_hybridsequential12_relu0_fwd attr_relu1_fwd 0=64 2=4096 9=1
Split                    splitncnn_4              1 4 attr_relu1_fwd attr_relu1_fwd_splitncnn_0 attr_relu1_fwd_splitncnn_1 attr_relu1_fwd_splitncnn_2 attr_relu1_fwd_splitncnn_3
InnerProduct             attr_dense3_fwd          1 1 attr_relu1_fwd_splitncnn_3 attr_relu2_fwd 0=64 1=1 2=4096 9=1
InnerProduct             attr_land_fwd            1 1 attr_relu2_fwd attr_land_fwd 0=10 1=1 2=640
InnerProduct             attr_dense4_fwd          1 1 attr_relu1_fwd_splitncnn_2 attr_relu3_fwd 0=32 1=1 2=2048 9=1
InnerProduct             attr_dense5_fwd          1 1 attr_relu3_fwd attr_glass_fwd 0=1 1=1 2=32 9=4
InnerProduct             attr_dense6_fwd          1 1 attr_relu0_fwd_splitncnn_1 attr_relu4_fwd 0=32 1=1 2=2048 9=1
InnerProduct             attr_dense7_fwd          1 1 attr_relu4_fwd attr_male_fwd 0=1 1=1 2=32 9=4
InnerProduct             attr_dense8_fwd          1 1 attr_relu1_fwd_splitncnn_1 attr_relu5_fwd 0=32 1=1 2=2048 9=1
InnerProduct             attr_dense9_fwd          1 1 attr_relu5_fwd attr_smile_fwd 0=1 1=1 2=32 9=4
InnerProduct             attr_dense10_fwd         1 1 attr_relu1_fwd_splitncnn_0 attr_relu6_fwd 0=32 1=1 2=2048 9=1
InnerProduct             attr_dense11_fwd         1 1 attr_relu6_fwd attr_hat_fwd 0=1 1=1 2=32 9=4
InnerProduct             attr_dense12_fwd         1 1 attr_relu0_fwd_splitncnn_0 attr_relu7_fwd 0=128 1=1 2=8192 9=1
InnerProduct             attr_dense13_fwd         1 1 attr_relu7_fwd attr_age_fwd 0=1 1=1 2=128 9=4
