7767517
31 35
Input                    data                     0 1 data
BinaryOp                 resnetv10__mulscalar0    1 1 data resnetv10__mulscalar0 0=2 1=1 2=3.921000e-03
Convolution              resnetv10_hybridsequential0_conv0_fwd 1 1 resnetv10__mulscalar0 resnetv10_hybridsequential0_relu0_fwd 0=16 1=5 3=2 4=2 5=1 6=1200 9=1
Convolution              resnetv10_hybridsequential1_conv0_fwd 1 1 resnetv10_hybridsequential0_relu0_fwd resnetv10_hybridsequential1_batchnorm0_fwd 0=32 1=3 3=2 4=1 5=1 6=4608
Split                    splitncnn_0              1 2 resnetv10_hybridsequential1_batchnorm0_fwd resnetv10_hybridsequential1_batchnorm0_fwd_splitncnn_0 resnetv10_hybridsequential1_batchnorm0_fwd_splitncnn_1
Convolution              resnetv10_hybridsequential3_conv0_fwd 1 1 resnetv10_hybridsequential1_batchnorm0_fwd_splitncnn_1 resnetv10_hybridsequential3_relu0_fwd 0=32 1=3 4=1 5=1 6=9216 9=1
Convolution              resnetv10_hybridsequential4_conv0_fwd 1 1 resnetv10_hybridsequential3_relu0_fwd resnetv10_hybridsequential4_batchnorm0_fwd 0=32 1=3 4=1 5=1 6=9216
BinaryOp                 resnetv10_elemwise_add0  2 1 resnetv10_hybridsequential1_batchnorm0_fwd_splitncnn_0 resnetv10_hybridsequential4_batchnorm0_fwd resnetv10_elemwise_add0
ReLU                     resnetv10_activation0    1 1 resnetv10_elemwise_add0 resnetv10_activation0
Split                    splitncnn_1              1 2 resnetv10_activation0 resnetv10_activation0_splitncnn_0 resnetv10_activation0_splitncnn_1
Convolution              resnetv10_hybridsequential6_conv0_fwd 1 1 resnetv10_activation0_splitncnn_1 resnetv10_hybridsequential6_batchnorm0_fwd 0=64 1=3 3=2 4=1 5=1 6=18432
Convolution              resnetv10_hybridsequential8_conv0_fwd 1 1 resnetv10_activation0_splitncnn_0 resnetv10_hybridsequential8_relu0_fwd 0=64 1=3 3=2 4=1 5=1 6=18432 9=1
Convolution              resnetv10_hybridsequential9_conv0_fwd 1 1 resnetv10_hybridsequential8_relu0_fwd resnetv10_hybridsequential9_batchnorm0_fwd 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 resnetv10_elemwise_add1  2 1 resnetv10_hybridsequential6_batchnorm0_fwd resnetv10_hybridsequential9_batchnorm0_fwd resnetv10_elemwise_add1
ReLU                     resnetv10_activation1    1 1 resnetv10_elemwise_add1 resnetv10_activation1
Split                    splitncnn_2              1 2 resnetv10_activation1 resnetv10_activation1_splitncnn_0 resnetv10_activation1_splitncnn_1
Convolution              resnetv10_hybridsequential11_conv0_fwd 1 1 resnetv10_activation1_splitncnn_1 resnetv10_hybridsequential11_relu0_fwd 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              resnetv10_hybridsequential12_conv0_fwd 1 1 resnetv10_hybridsequential11_relu0_fwd resnetv10_hybridsequential12_batchnorm0_fwd 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 resnetv10_elemwise_add2  2 1 resnetv10_activation1_splitncnn_0 resnetv10_hybridsequential12_batchnorm0_fwd resnetv10_elemwise_add2
ReLU                     resnetv10_activation2    1 1 resnetv10_elemwise_add2 resnetv10_activation2
Split                    splitncnn_3              1 2 resnetv10_activation2 resnetv10_activation2_splitncnn_0 resnetv10_activation2_splitncnn_1
Convolution              resnetv10_hybridsequential14_conv0_fwd 1 1 resnetv10_activation2_splitncnn_1 resnetv10_hybridsequential14_batchnorm0_fwd 0=128 1=3 13=2 4=1 5=1 6=73728
Convolution              resnetv10_hybridsequential16_conv0_fwd 1 1 resnetv10_activation2_splitncnn_0 resnetv10_hybridsequential16_relu0_fwd 0=128 1=3 13=2 4=1 5=1 6=73728 9=1
Convolution              resnetv10_hybridsequential17_conv0_fwd 1 1 resnetv10_hybridsequential16_relu0_fwd resnetv10_hybridsequential17_batchnorm0_fwd 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 resnetv10_elemwise_add3  2 1 resnetv10_hybridsequential14_batchnorm0_fwd resnetv10_hybridsequential17_batchnorm0_fwd resnetv10_elemwise_add3
ReLU                     resnetv10_activation3    1 1 resnetv10_elemwise_add3 resnetv10_activation3
Convolution              resnetv10_hybridsequential19_conv0_fwd 1 1 resnetv10_activation3 resnetv10_hybridsequential19_relu0_fwd 0=128 1=3 5=1 6=147456 9=1
Convolution              resnetv10_hybridsequential21_conv0_fwd 1 1 resnetv10_hybridsequential19_relu0_fwd resnetv10_hybridsequential21_relu0_fwd 0=256 1=11 11=1 4=5 14=0 5=1 6=360448 9=1
Convolution              resnetv10_conv0_fwd      1 1 resnetv10_hybridsequential21_relu0_fwd resnetv10_conv0_fwd 0=73 1=1 5=1 6=18688
Permute                  resnetv10_transpose0     1 1 resnetv10_conv0_fwd resnetv10_transpose0 0=4
Squeeze                  resnetv10_squeeze0       1 1 resnetv10_transpose0 resnetv10_squeeze0 0=1 1=1 2=1
